Repository: wgwoods/dnf-plugin-system-upgrade
Catalog: po/*.po
Languages: uk

source: '%s' is not used anymore. Ignoring.
uk: «%s» більше не використовується. Ігноруємо.

source: '--clean-metadata' removed. Use 'dnf clean metadata --releasever=VER'
uk: «--clean-metadata» вилучено. Скористайтеся командою «dnf clean metadata --releasever=ВЕРСІЯ»

source: '--expire-cache' removed. Use 'dnf system-upgrade download --refresh'
uk: «--expire-cache» вилучено. Скористайтеся «dnf system-upgrade download --refresh»

source: -- no logs were found --
uk: -- журналів не знайдено --

source: --datadir: File exists
uk: --datadir: файл вже існує

source: Can't do '%s' and '%s' at the same time.
uk: Не можна виконувати «%s» і «%s» одночасно.

source: Can't redirect DNF logs with --debuglog. Use DNF debug options instead.
uk: Не вдалося переспрямувати виведення журналу DNF за допомогою --debuglog. Скористайтеся краще параметрами діагностики DNF.

source: Cannot find logs with this index.
uk: Не вдалося знайти журнал із цим покажчиком.

source: Cleaning up downloaded data...
uk: Вилучаємо зайві отримані дані…

source: Download complete! Use 'dnf %s reboot' to start the upgrade.
uk: Отримання даних завершено! Скористайтеся командою «dnf %s reboot» для запуску оновлення.

source: Download finished.
uk: Отримання даних завершено.

source: Need a --releasever greater than the current system version.
uk: Слід вказати параметр --releasever із версією, що перевищує поточну версію системи.

source: No new kernel packages were found.
uk: Нових пакунків ядра не виявлено.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Prepare system for upgrade to a new release
uk: Приготувати систему до оновлення до нового випуску

source: Rebooting to perform upgrade.
uk: Перезавантажуємо систему для завершення оновлення.

source: Sorry, dnf doesn't support '%(option)s'
uk: Вибачте, підтримки «%(option)s» не передбачено

source: Sorry, dnf system-upgrade doesn't support '%(option)s'
uk: Вибачте, у dnf system-upgrade не передбачено підтримки «%(option)s»

source: Sorry, you need to use 'download --releasever' instead of '--network'
uk: Вибачте, слід використовувати «download --releasever», а не «--network»

source: Starting system upgrade. This will take a while.
uk: Починаємо оновлення системи. Будь ласка, зачекайте.

source: The following boots appear to contain upgrade logs:
uk: Здається, журнали оновлення містяться у записах таких завантажень:

source: This plugin requires DNF 1.1.0 or later.
uk: Для роботи цього додатка потрібна DNF 1.1.0 або новіша версія.

source: Upgrade complete! Cleaning up and rebooting...
uk: Оновлення завершено! Вилучаємо зайві дані і перезавантажуємо системи…

source: VERSION
uk: ВЕРСІЯ

source: action to perform
uk: дія, яку слід виконати

source: another upgrade tool is running. exiting quietly.
uk: працює інший інструмент із оновлення системи, завершуємо роботу без додаткових повідомлень.

source: download options
uk: параметри отримання даних

source: keep installed packages if the new release's version is older
uk: зберігати встановлені пакунки, якщо версія нового випуску є старішою

source: log options
uk: параметри ведення журналу

source: release version (required)
uk: версія випуску (обов’язково)

source: save downloaded data to this location
uk: зберегти отримані дані до вказаного місця

source: system is not ready for upgrade
uk: система не готова до оновлення

source: the color of the sky
uk: колір неба

source: upgrade is already scheduled
uk: оновлення вже заплановано

source: use '%s reboot' to begin the upgrade
uk: скористайтеся командою «%s reboot», щоб розпочати оновлення

source: which logs to show (-1 is last, etc)
uk: який журнал показувати (-1 — останній тощо)
